"""
维语一共8个元音，IPA中的 ئى 和 ئە 对应着两个音标因此IPA_VOWELS 多了两个元素
"""

IPA_VOWELS = ['\u0251', '\u025b', '\u00e6', '\u006f', '\u0075', '\u00f8', '\u0079', '\u0065', '\u0069', '\u0268']
UEY_VOWELS = ['\u0627', '\u06d5', '\u0648', '\u06c7', '\u06c6', '\u06c8', '\u06d0', '\u0649']
ULY_VOWELS = ['\u0061', '\u0065', '\u006f', '\u0075', '\u00f6', '\u00fc', '\u00eb', '\u0069']
UYY_VOWELS = ['\u0061', '\u0259', '\u006f', '\u0075', '\u0275', '\u00fc', '\u0065', '\u0069']
UKY_VOWELS = ['\u0430', '\u04d9', '\u043e', '\u0443', '\u04e9', '\u04af', '\u0435', '\u0438']
